# FabricationHostedInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationHostedInfo Methods
FabricationHostedInfo Class See Also
---
The FabricationHostedInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DisconnectFromHost | Disconnects the part from the host. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBearerCenterline | Gets the centerline of the bearer. The method is applicable only for bearer hanger. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| PlaceOnHost(ElementId, Connector, Double) | Places the part on the specified host. |
| PlaceOnHost(ElementId, Connector, Double, Double) | Places the part on the specified host. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace